// Задача 10: Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.
// 456 -> 5
// 782 -> 8
// 918 -> 1

// Console.Write("Введите трехзначное число: ");
// int number = Convert.ToInt32(Console.ReadLine());

// while (number >= 100)
// {
//     number /= 10;
// }
// int num = number % 10;
// Console.Write("Вторая цифра числа: " + num);




 
//  Задача 15: Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.
// 6 -> да
// 7 -> да
// 1 -> нет
// Console.Write("Введите цифру обозначающий день недели: ");
// int number = Convert.ToInt32(Console.ReadLine());
// if(number > 5){
//     Console.Write("Выходной день");
// }else Console.WriteLine("Рабочий день");

